In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
path='./data/'

users = pd.read_csv(path+'users.csv')
books = pd.read_csv(path+'books.csv')
ratings = pd.read_csv(path+'train_ratings.csv')

In [3]:
users = users.replace('na', np.nan)
users = users.replace('', np.nan)
users = users.replace('unknown', np.nan)

In [4]:
df = users['location'].apply(lambda x: x.split(',')).apply(lambda x: len(x))
idx_len_up_to_4 = df[df >= 4].index

In [6]:
users.iloc[idx_len_up_to_4].to_csv('wrong_comma.csv')

In [10]:
# 숫자 있는 거 확인하기
def hasNumber(stringVal):
    try:
        return any(elem.isdigit() for elem in stringVal)
    except:
        return np.nan
df = users[(users['location'].apply(lambda x: hasNumber(x)) == True)]

In [11]:
df

       user_id                                   location   age
353     200234          r.r.#1 battersea, ontario, canada  53.0
864      28800          03770 el verger, (alacant), spain  69.0
1073     57515      8125-915 vilamoura, algarve, portugal  44.0
2491    268009                    dublin 12, n/a, ireland  41.0
2541    276113       &#321;ód&#378;, &#322;ódzkie, poland  21.0
...        ...                                        ...   ...
66153   179594                3014 bern, n/a, switzerland  55.0
66558   193663  23564 lübeck, schleswig-holstein, germany  38.0
66975   211984         19258 boizenburg, hamburg, germany   NaN
67789   256636     89075 ulm, baden-wuerttemberg, germany  51.0
68053   275892                   82061, calabria, germany  43.0

[82 rows x 3 columns]

In [19]:
wrong_datas = users.iloc[idx_len_up_to_4].merge(df, how='left', on='user_id')

In [14]:
wrong_datas.to_csv('wrong_users_data.csv')

In [15]:
users[users['user_id'] == 192292]

      user_id                                  location  age
3553   192292  4729 pepperwood ave, long beach, ca, usa  NaN

In [21]:
df = wrong_datas.drop('location_y', axis=1).drop('age_y', axis=1)

In [24]:
df.rename(columns={'location_x':'location'}, inplace=True)
df.rename(columns={'age_x':'age'}, inplace=True)

In [26]:
df.to_csv('wrong_users_data.csv')

In [17]:
wrong_datas = users.iloc[idx_len_up_to_4].merge(df, how='left', on='location')

In [18]:
wrong_datas

,user_id_x,location,age_x,user_id_y,age_y
0,259223,"twin falls, idaho, idaho, usa",82.0,NaN,NaN
1,14387,"coalville, leicestershire, england, united kin...",35.0,NaN,NaN
2,38464,"tharston, norwich, england, united kingdom",33.0,NaN,NaN
3,51856,"wichita,, kansas, usa",59.0,NaN,NaN
4,53688,"paris, france, ile de france, france",28.0,NaN,NaN
...,...,...,...,...,...
290,202347,"seba beach, ab., alberta, canada",NaN,NaN,NaN
291,217416,"crivitz,, wisconsin, usa",NaN,NaN,NaN
292,229756,"prineville,, oregon, usa",66.0,NaN,NaN
293,278215,"nelson, motueka, nz, new zealand",28.0,NaN,NaN
294,245812,"canberra, act, australian capital territory, a...",NaN,NaN,NaN